Additional Testing: After replacing the provider with the modified one I compiled, here is what the plan looks like:

```
  # aws_iam_access_key.abcdef is tainted, so must be replaced
-/+ resource "aws_iam_access_key" "abcdef" {
      + encrypted_secret  = (known after apply)
      ~ id                = "AKIAY3WDEADBEEFQH2EU" -> (known after apply)
      + key_fingerprint   = (known after apply)
      ~ secret            = (sensitive value)
      ~ ses_smtp_password = (sensitive value)
      ~ status            = "Active" -> (known after apply)
        user              = "abcdef"
    }
```

Before, `secret` and `ses_smtp_password` were visible in the clear.